name=str(input("enter your name:"))
lastname=str(input("enter your lastname:"))
age=int(input("enter your age:"))
print(name)
print(lastname)
print(age)


num0 = 20
num1 = 30
print(num1>num0)
print(num0<num1)
print(num0==num1)

# ტიპი "type" -  მნიშვნელობის შემოწმება
#ინტეჯერი "int" - მტელი რიცხვი
#ფლოათ "float" - ათწილადი



#int() ეს ფუნქცია გვეხმარება იმასჰი რომ გარდავქმნად ინტეგერად ანუ მთელ რიცხვად
#float()# ფუნქციები რომლებიც ერთი მონაცემთა ტიპიდან გადაყვათ მეორეში 
# ამ შემთხვევაში int(),str() და float() ქვიათ მექანიკური მონაცემთა ტიპის შეცვლა
# მექანიკურში ვგულისხმობ იმას რომ ჩვენ ჩვენი ხელით გარდავქმნით ერთი ტიპიდან მეორეში

# int() ეს ფუნქცია გვეხმარება იმაში რომ მნიშვნელობა გარდავქმნათ ინტეჯერად ანუ მთელ რიცხვად.
print(int(5.9))
print(int("5") + 5)

# float() ეს ფუნქცია გვეხმარება იმაში რომ მნიშვნელობა გარდავქმნათ ათწილად რიცხვად.
print(float("5.6"))
print(float(3))

# str() ეს ფუნქცია გვეხმარება იმაში რომ ნებისმიერი მნიშვნელობა გარდავქმნათ სტრინგად.


# type() ეს ფუნქცია გვეხმარება იმაში რომ გავიგოთ კონკრეტული მნიშვნელობა რა ტიპის არის.
print(type(3.1))
print(type(5))
print(type("luka"))







